app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.markup_content = RedCloth.new(params[:comment][:content]).to_html
    @comment.user_id = current_user.id

    @comment_saved = @comment.save
---
INSERT INTO `comments` (`created_at`, `updated_at`, `post_id`, `user_id`, `markup_content`, `content`) VALUES('2009-02-16 14:57:27', '2009-02-16 14:57:27', NULL, 1, '<p>fsdf sdf dsgss</p>', 'fsdf sdf dsgss')