app/controllers/posts_controller.rb

  def index
    user = User.find_by_login(params[:user_login])
    user = User.find(params[:user_id]) unless user
---
SELECT * FROM `users` WHERE (`users`.`login` = 'bacdh') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id
    @post.markup_content = RedCloth.new(params[:post][:content].strip).to_html

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `user_id`, `markup_content`, `content`, `comments_count`) VALUES('2009-02-14 03:58:51', ' Left panel', '2009-02-14 03:58:51', 1, '<p>Left panel include menu of ancient author Left panel include menu of ancient author <br />\n Left panel include menu of ancient author Left panel include menu of ancient author <br />\n Left panel include menu of ancient author <br />\n Left panel include menu of ancient author <br />\n Left panel include menu of ancient author</p>', ' Left panel include menu of ancient author Left panel include menu of ancient author \r\n Left panel include menu of ancient author Left panel include menu of ancient author \r\n Left panel include menu of ancient author \r\n Left panel include menu of ancient author \r\n Left panel include menu of ancient author ', 0)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post].merge(:markup_content => RedCloth.new(params[:post][:content].strip).to_html))
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
UPDATE `posts` SET `content` = ' Left panel include menu of ancient author \r\n Left panel include menu of ancient author \r\nLeft panel include menu of ancient author \r\n Left panel include menu of ancient author \r\n Left panel include menu of ancient author \r\n Left panel include menu of ancient author ', `markup_content` = '<p>Left panel include menu of ancient author <br />\n Left panel include menu of ancient author <br />\nLeft panel include menu of ancient author <br />\n Left panel include menu of ancient author <br />\n Left panel include menu of ancient author <br />\n Left panel include menu of ancient author</p>', `updated_at` = '2009-02-07 09:44:27' WHERE `id` = 4