app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `posts_count`, `login`, `email`, `created_at`) VALUES('', '3129f339a28738ed8128d3356e5b2932dd89af20', '2009-02-07 04:34:00', '7454d25d931e66fa7eef3761f5cc0473c517aa0c', NULL, NULL, NULL, 'bacdh', 'dohaibac@gmail.com', '2009-02-07 04:34:00')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save